{"pageProps":{"post":{"slug":"printer-enclosure","related":["/projects/printer-filament"],"external":[],"title":"Printer Enclosure","heading":"3D Printer Enclosure","date":"2018-07-05T00:00:00.000Z","preview":"/assets/blog/printer-enclosure/enclosure-hero.jpg","author":{"name":"Mike Thomas","picture":"/assets/authors/mike.jpg"},"description":"Creating a 3D printer enclosure using 2 Ikea Lack tables.","tags":["Anet A8","Ikea","Voron"],"categories":[],"keywords":["Enclosure"],"promoted":false,"content":"\n# Table of contents\n\n# Assembling Tables\n\n![Assembling Lack Tables](/assets/blog/printer-enclosure/lack-table-one.jpg)\n\nI purchased and assembled 2 Lack tables from Ikea to make a more permanent home for my 3D printer. I had some casters laying around from an old TV cabinet, so I screwed them to the bottom of one of the tables to make the unit a little easier to move around (never throw anything out, you never know when they might come in useful).\n\n# Adding Risers\n\n![Attaching the 3D Printed Risers](/assets/blog/printer-enclosure/lack-table-two.jpg)\n\nThe top table needs to be attached to the bottom one in some way, and will also need to be raised slightly to allow enough space to fit the printer inside. I found [some risers on Thingyverse](https://www.thingiverse.com/thing:2153564) by user [Tobi97l](https://www.thingiverse.com/Tobi97l) that didn't need any hardware to attach the tables together, which also had the option to permenently attach them at a later date with screws. It is a remix of [another riser by Latzenpratz](https://www.thingiverse.com/thing:1814763) so I printed the top connectors from that.\n\n# Enclosing the Printer\n\n![Lack Table Enclosure Assembled](/assets/blog/printer-enclosure/assembled.jpg)\n\nI used some cardboard from the box the printer came in to get an idea of what size acrylic sheets I would need to purchase to fully enclose the printer, however, the cost of buying 3 large custom cut-to-size panels for the sides and 2 smaller ones for the doors turned out to be quite expensive (around £50-60), so the enclosure has remained unfinished for about a 5 years.\n\n# Ongoing Upgrades\n\n![Enclosure - Cat Approved](/assets/blog/printer-enclosure/cat-approved.jpg)\n\nI have recently been needing to print some ABS parts that will be close to the hotend of the printer as ABS deals with higher temperatures better than PETG that I normally print with. Therefore, I have been looking at enclosing the printer again to prevent warping of parts as ABS is very prone to shrinkage and warping, when not printed in an enclosure.\n\nI have purchased some [Corroplast sheets](https://www.amazon.co.uk/gp/product/B016EMNWS4) to replace the cardboard box sides, and plan to purchase some clear acrylic sheets to use as doors on the front using some [3D printed hinges](#handle-and-hinges).\n\n![Temporary Setup for Printing ABS](/assets/blog/printer-enclosure/temporary-abs-enclosure.jpg)\n\nThis is not how I was originally intending on using the Corroplast sheets to enclose the printer, However I will need most of the new sheets to build the new printer so have decided not to cut them down yet.\n\n## Filament Storage\n\n![I may have a filament purchasing problem](/assets/blog/printer-enclosure/filament.jpg)\n\nI seem to be planning projects faster than actually completing them, therefore I have now aquired more filament than I can store in my filament pile.\n\nNow that I have assembled [my new frame](printer-voron-1.8#frame) this printer is too tall to fit inside the Lack enclosure. I have therefore decided to buy an Ikea Ivar cabinet to hold my unused filament spools, my Voron Printers and some tools.\n\nI have also removed the lower table's legs of the original enclosure and attached the casters underneath the lower tables tabletop, however I plan on adding [these adapters](https://www.thingiverse.com/thing:2598673) in the future which should also stiffen the attachment of the casters to the table.\n\n![New Enclosure built using Ikea Ivar cabinet](/assets/blog/printer-enclosure/new-ikea-ivar.jpg)\n\n## Handle and Hinges\n\n![3D Printed Hinges](/assets/blog/printer-enclosure/hinges.jpg)\n\nOnce I have some clear acrylic panels for the doors I will need to attach them to the enclosure some way so I have already printed some [Hinges](https://www.thingiverse.com/thing:2378793). Then I will print a couple of [Handles](https://www.thingiverse.com/thing:2459045) to make the doors easier to open.\n\n## Carbon Filter Exhaust\n\n![Voron Carbon Exhaust Filter](/assets/blog/printer-enclosure/carbon-filter-exhaust.jpg)\n\nAs I am planning on printing with ABS, I want to run any gasses produced through a carbon filter to reduce the smell. I plan on using the [Exhaust filter housing from the Voron Printer](https://github.com/VoronDesign/Voron-1/tree/Voron1.8/STLs/Exhaust_Filter), attached to the rear Coroplast sheet. This is also a part that can be attached directly to the printer when I have upgraded to the new frame.\n","lastmod":"2023-08-25T00:00:00.000Z"},"related":[{"slug":"printer-filament","related":[],"external":[],"title":"Printer Filament","heading":"","date":"","preview":"/assets/blog/printer-filament/filament-hero.jpg","author":{"name":"","picture":""},"description":"","tags":[],"categories":[],"keywords":[],"promoted":false,"content":""}]},"__N_SSG":true}